hackathon/src/DataProcessors/ЗагрузитьДанныеПоОценкеКачества/ЗагрузитьДанныеПоОценкеКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузитьДанныеПоОценкеКачества</name>
</mdclass:DataProcessor>

hackathon/src/InformationRegisters/ОценкаКачестваОбслуживания/ОценкаКачестваОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаКачестваОбслуживания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОбращениеРешено</name>
    <type>
      <types>EnumRef.РешеноЛиОбращение</types>
    </type>
  </resources>
  <resources>
    <name>УдобствоРаботыСОбращениями</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОценкаСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПожеланияИПредложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Респондент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/Enums/РешеноЛиОбращение/РешеноЛиОбращение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РешеноЛиОбращение</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>Частично</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

hackathon/src/DataProcessors/ЗагрузитьДанныеПоОценкеКачества/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ОбластиТаб = ТабДок.Область(1, 1, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы);

	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластиТаб);  
	Построитель.Выполнить();
	
	ТабДанные = Построитель.Результат.Выгрузить(); 
	
	Набор = РегистрыСведений.ОценкаКачестваОбслуживания.СоздатьНаборЗаписей();
	Набор.Записать();
	
	НаборЗаписей = РегистрыСведений.ОценкаКачестваОбслуживания.СоздатьНаборЗаписей();

	Для Каждого Элем Из ТабДанные Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Период = Дата(Элем.Дата); 
		НоваяЗапись.Респондент = Элем.Респондент; 
		
		Если Элем.ОбращениеБылоРешено_ = "Да" Тогда 
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Да;
		ИначеЕсли Элем.ОбращениеБылоРешено_ = "Частично" Тогда 
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Частично;
		ИначеЕсли Элем.ОбращениеБылоРешено_ = "Нет" Тогда
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Нет;
		Иначе
			НоваяЗапись.ОбращениеРешено = Перечисления.РешеноЛиОбращение.Другое;	
		КонецЕсли; 
		НоваяЗапись.УдобствоРаботыСОбращениями = Число(Элем.НаСколькоУдобноБылоРаботатьСОбращением_);
		НоваяЗапись.ОценкаСотрудника = Число(Элем.ОценитеСотрудника);
		НоваяЗапись.ПожеланияИПредложения = Элем.ПожеланияИПредложения;
	КонецЦикла; 
	
	НаборЗаписей.Записать();
		
КонецПроцедуры
